Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/children_s_health/immunisations_for_children.html.txt.tmx
Source language: en
Languages: ga

source: Immunisations for children and young people
ga: Tá seirbhísí vacsaínithe agus imdhíonta ar fáil saor in aisce do pháistí agus do dhaoine óga

source: Children and young people are entitled to certain immunisation services free of charge
ga: Tá páistí agus daoine óga i dteideal seirbhísí imdhíonta áirithe saor in aisce

source: These are provided in GP surgeries, in hospitals, in health clinics or in school (depending on the circumstances)
ga: Soláthraítear na seirbhísí seo i máinliachtaí Dochtúirí Ginearálta (DG), in ospidéil, i gclinicí sláinte an FSS nó i scoileanna (ag brath ar na cúinsí)

source: Immunisation is a safe and effective way to help the body prevent or fight off certain diseases
ga: Is dóigh shlán éifeachtach é imdhíonadh le cuidiú leis an gcorp galair áirithe a chomhrac

source: Immunisation is provided through vaccinations
ga: Soláthraítear imdhíonadh trí vacsaínithe

source: Under the Childhood Immunisation Programme all vaccines and their administration are provided free of charge for all children
ga: Faoin mBunchlár um Imdhíonadh Óige soláthraítear gach vacsaíniú agus a ndáileadh saor in aisce do gach páiste

source: Parents must consent to vaccinations for children and young people up to the age of 16
ga: Ní mór aontú na dtuismitheoirí a fháil chun vacsaínithe a dháileadh do pháistí agus do dhaoine óga suas le 16 bliana d’aois

source: Vaccination is not compulsory, but is strongly advised by the Department of Health
ga: Níl vacsaíniú éigeantach, ach molann an Roinn Sláinte go mór é

source: You should discuss any concerns you may have with your GP/family doctor before making a decision about your child's immunisation
ga: Ba chóir duit aon imní a d’fhéadfadh a bheith agat a phlé le do DG/dhochtúir teaghlaigh sula ndéanann tú aon chinneadh faoi imdhíonadh do pháiste

source: Birth Hospital or HSE clinic BCG vaccination (a vaccine to protect against tuberculosis)
ga: │Breith │Ospidéal nó clinic FSS│Vacsaíniú BCG (vacsaíniú chun cosaint i gcoinne eitinne) │

source: 2 months GP 6 in 1 (diphtheria, tetanus, whooping cough (pertussis), polio, Hib (Haemophilus Influenzae Type B) and Hepatitis B is provided in one single injection) plus vaccine against Pneumococcal Disease in a separate injection
ga: │2 mhí │DG │Vacsaíniú 6 in 1 (diftéire, teiteanas, triuch, polaimiailítis. HiB (Haemophilus Influenzae Cineál B agus Heipitíteas B) in aon instealladh amháin) móide vacsaíniú i gcoinne galar niúmacocúil in instealladh ar leith

source: Babies born on or after 1 October 2016 are also given vaccines against Meningococcal B and rotavirus disease
ga: Tugtar vacsaíní do naíonáin a bheirtear ó 1 Deireadh Fómhair 2016 ar aghaidh freisin i gcoinne Meiningeacocúil B agus galair rótaivíris

source: In addition, babies born before 1 October 2016 are vaccinated against Meningococcal C
ga: │4 mhí │DG │Ina theannta sin, is amhlaidh a vacsaínítear naíonáin a rugadh roimh 1 Deireadh Fómhair 2016 i gcoinne Meiningeacocúil C

source: Babies born on or after 1 October are given vaccines against Meningococcal B and rotavirus disease
ga: Tugtar vacsaíní do naíonáin a bheirtear tar éis 1 Deireadh Fómhair i gcoinne Meiningeacocúil B agus galair rótaivíris

source: 6 months GP 6 in 1 (diphtheria, tetanus, whooping cough (pertussis), polio, Hib (Haemophilus Influenzae Type B) and Hepatitis B is provided in one single injection) and also vaccine against Pneumococcal Disease
ga: │6 mhí │DG │6 in 1 (diftéire, teiteanas, tiuch (pertussis), póilió, HIB (Haemophilus Influenzae cineál B) agus Heipitíteas B a thugtar mar instealladh amháin) agus vacsaín freisin i gcoinne Galair Niúmacocúil

source: Babies born on or after 1 October are also given vaccine against Meningococcal C
ga: Tugtar vacsaín do naíonáin freisin a bheirtear an 1 Deireadh Fómhair nó dá éis sin i gcoinne Meiningeacocúil C

source: 12 months GP MMR (measles, mumps and rubella) vaccine
ga: │12 mhí │DG │An vacsaín MMR (bruitíneach, leicneach agus rubella)

source: In addition, babies born before 1 October 2016 are given vaccine against Pneumococcal Disease
ga: Ina theannta sin, tugtar an vacsaín i gcoinne Galair Niúmacocúil do naíonáin a rugadh roimh 1 Deireadh Fómhair 2016

source: Babies born on or after 1 October are given vaccine against Meningococcal B
ga: Tugtar vacsaín i gcoinne Meiningeacocúil B do naíonáin a bheirtear an 1 Deireadh Fómhair nó dá éis sin

source: Babies born on or after 1 October 2016 are given vaccine against Pneumococcal Disease
ga: │13 mhí │DG │Vacsaíniú i gcoinne Meiningíteas C agus HiB (Haemophilus Influenzae Cineál B).Tugtar an vacsaín i gcoinne Galair Niúmacocúil do naíonáin a bheirtear an 1 Deireadh Fómhair 2016 nó ina dhiaidh sin

source: 4–5 years GP or school 4 in 1 (diphtheria, tetanus, whooping cough (pertussis) and polio), plus MMR (measles, mumps and rubella) vaccine
ga: │4-5 bliana │DG nó scoil │4 in 1 (diftéire, teiteanas, triuch agus polaimiailítis) móide MMR (bruitíneach, leicneach agus bruitíneach dhearg) │

source: School HPV (Human Papillomavirus Virus) vaccine (2 doses)
ga: │Cailíní sa chéad bhliain i scoileanna dara leibhéal │Scoil │HPV (vacsaín i gcoinne an víreas daonna papilloma) │

source: These vaccinations are free of charge
ga: Tá na vacsaínithe seo ar fáil saor in aisce

source: Information about all immunisations is available from your GP, public health nurse or Local Health Office
ga: Tá faisnéis faoi gach vacsaíniú ar fáil ó do DG, d’altra sláinte poiblí nó d’Oifig Sláinte Áitiúil

source: The HSE's National Immunisation Office Website and the Health Protection Surveillance Centre (HPSC), have produced useful factsheets on immunisations for parents, in a number of languages
ga: Tháirg Oifig Imdhíonta Náisiúnta Fheidhmeannacht na Seirbhíse Sláinte, agus an tIonad Faireachais um Chosaint Sláinte (HPSC) bileoga eolais úsáideacha do thuismitheoirí maidir le imdhíonadh

source: Childhood immunisation services are usually offered to parents in the hospital where the baby was born and by contact from the HSE, through GPs and through the schools immunisation programme
ga: De ghnáth cuirtear seirbhísí imdhíonta ar fáil do thuismitheoirí san ospidéal inar rugadh an leanbh agus trí theagmháil leis an FSS, trí DG agus tríd an gclár imdhíonta ar scoileanna

source: You can also contact your Local Health Office or your GP directly
ga: Is féidir leat teagmháil a dhéanamh go díreach le d’Oifig Sláinte Áitiúil nó le do DG chun leas a bhaint as an tseirbhís
